load_test.yml
config:
  target: "https://rubyvideo.dev"
  phases:
    - duration: 30
      arrivalRate: 5
      name: Warm up
    - duration: 30
      arrivalRate: 5
      rampTo: 30
      name: Ramp up load
  payload:
    path: search_payload.csv
    fields:
      - name
scenarios:
  - name: "visit home page"
    flow:
      - get:
          url: "/talks"
      - get:
          url: "/talks?q={{ name }}"
      - get:
          url: "/talks?q={{ name }}"
      - get:
          url: "/talks?q={{ name }}"
      - get:
          url: "/speakers"